## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 15 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| add    | `aws_security_group.idp_db`                             |
|        | `aws_security_group.idp_ecs`                            |
|        | `aws_security_group.idp_lb`                             |
|        | `aws_security_group_rule.idp_db_egress_privatelink`     |
|        | `aws_security_group_rule.idp_db_ingress_ecs`            |
|        | `aws_security_group_rule.idp_ecs_egress_db`             |
|        | `aws_security_group_rule.idp_ecs_egress_internet`       |
|        | `aws_security_group_rule.idp_ecs_egress_privatelink`    |
|        | `aws_security_group_rule.idp_ecs_egress_smtp_tls`       |
|        | `aws_security_group_rule.idp_ecs_ingress_lb`            |
|        | `aws_security_group_rule.idp_lb_egress_ecs`             |
|        | `aws_security_group_rule.idp_lb_ingress_internet_http`  |
|        | `aws_security_group_rule.idp_lb_ingress_internet_https` |
|        | `aws_security_group_rule.privatelink_idp_db_ingress`    |
|        | `aws_security_group_rule.privatelink_idp_ecs_ingress`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.idp_db will be created
  + resource "aws_security_group" "idp_db" {
      + arn                    = (known after apply)
      + description            = "Zitadel IdP database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "idp_db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group.idp_ecs will be created
  + resource "aws_security_group" "idp_ecs" {
      + arn                    = (known after apply)
      + description            = "Zitadel IdP ECS Tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "idp_ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group.idp_lb will be created
  + resource "aws_security_group" "idp_lb" {
      + arn                    = (known after apply)
      + description            = "Zitadel IdP load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "idp_lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group_rule.idp_db_egress_privatelink will be created
  + resource "aws_security_group_rule" "idp_db_egress_privatelink" {
      + description              = "Egress from Zitadel IdP database to PrivateLink endpoints"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-089a83b7d81dff031"
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.idp_db_ingress_ecs will be created
  + resource "aws_security_group_rule" "idp_db_ingress_ecs" {
      + description              = "Ingress to database from Zitadel IdP ECS task"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.idp_ecs_egress_db will be created
  + resource "aws_security_group_rule" "idp_ecs_egress_db" {
      + description              = "Egress from Zitadel IdP ECS task to database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.idp_ecs_egress_internet will be created
  + resource "aws_security_group_rule" "idp_ecs_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress from Zitadel IdP ECS task to internet (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.idp_ecs_egress_privatelink will be created
  + resource "aws_security_group_rule" "idp_ecs_egress_privatelink" {
      + description              = "Egress from Zitadel IdP ECS task to PrivateLink endpoints"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-089a83b7d81dff031"
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.idp_ecs_egress_smtp_tls will be created
  + resource "aws_security_group_rule" "idp_ecs_egress_smtp_tls" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress from Zitadel IdP ECS task to SMTP"
      + from_port                = 465
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 465
      + type                     = "egress"
    }

  # aws_security_group_rule.idp_ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "idp_ecs_ingress_lb" {
      + description              = "Ingress from load balancer to Zitadel IdP ECS task"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.idp_lb_egress_ecs will be created
  + resource "aws_security_group_rule" "idp_lb_egress_ecs" {
      + description              = "Egress from load balancer to Zitadel IdP ECS task"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "egress"
    }

  # aws_security_group_rule.idp_lb_ingress_internet_http will be created
  + resource "aws_security_group_rule" "idp_lb_ingress_internet_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress from internet to the Zitadel IdP load balancer (HTTP)"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.idp_lb_ingress_internet_https will be created
  + resource "aws_security_group_rule" "idp_lb_ingress_internet_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress from internet to the Zitadel IdP load balancer (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.privatelink_idp_db_ingress will be created
  + resource "aws_security_group_rule" "privatelink_idp_db_ingress" {
      + description              = "Security group rule for Zitadel IdP database ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-089a83b7d81dff031"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.privatelink_idp_ecs_ingress will be created
  + resource "aws_security_group_rule" "privatelink_idp_ecs_ingress" {
      + description              = "Security group rule for Zitadel IdP ECS task ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-089a83b7d81dff031"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + idp_db_security_group_id      = (known after apply)
  + idp_ecs_security_group_id     = (known after apply)
  + idp_lb_security_group_id      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_egress"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_redis"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_lb"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.privatelink"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.forms_private[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
